tap "homebrew/bundle"
tap "homebrew/services"
tap "spotify/public"

# Regular installs
brew "diff-so-fancy"
brew "act"
brew "cmake"
brew "gh"
brew "ghcup"
brew "go"
brew "jq"      # json processing e.g. for scripts
brew "poppler" # for pdfunite
brew "neovim"
brew "node@16"
brew "python@3.11"
brew "ripgrep"
brew "fzf"

# Casks
cask "amethyst"
cask "iterm2"
cask "brave-browser"
cask "github"
cask "spotify"
cask "telegram"
cask "whatsapp"
cask "wireshark"
cask "protonvpn"
cask "bitwarden"
cask "alfred"
cask "raspberry-pi-imager"
